; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v11 ?v8)
             (pred_3 ?v7 ?v1)
             (pred_8 ?v11 ?v1)
             (pred_4 ?v3 ?v11 )
	     (pred_10 ?v11)
             (pred_1 ?v9)
             (pred_9 ?v7)
             (pred_11 ?v1)
             (pred_6 ?v11)
             (pred_12 ?v7)
             (pred_5 ?v11)
             (pred_2 ))



(:action op_5
:parameters (?v2 ?v4 ?v12 ?v6)
:precondition (and (pred_1 ?v2) (pred_1 ?v4) (pred_9 ?v12) (pred_11 ?v6)
          (pred_7 ?v2 ?v4) (pred_3 ?v12 ?v6)
                   (pred_8 ?v4 ?v6) (pred_10 ?v2) 
                   (pred_6 ?v4) (pred_12 ?v12))
:effect (and  (pred_5 ?v4) (not (pred_6 ?v4))))


(:action op_1
:parameters (?v2 ?v10)
:precondition (and (pred_1 ?v2) (pred_1 ?v10)
               (pred_10 ?v2) (pred_7 ?v2 ?v10) (pred_5 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v2))))

(:action op_3
:parameters (?v2 ?v12)
:precondition (and (pred_1 ?v2) (pred_9 ?v12) 
                  (pred_10 ?v2) (pred_4 ?v12 ?v2) (pred_2 ))
:effect (and (pred_12 ?v12)
   (not (pred_4 ?v12 ?v2)) (not (pred_2 ))))


(:action op_2
:parameters (?v2 ?v13 ?v5)
:precondition (and (pred_1 ?v2) (pred_9 ?v13) (pred_9 ?v5)
                  (pred_10 ?v2) (pred_12 ?v5) (pred_4 ?v13 ?v2))
:effect (and (pred_12 ?v13) (pred_4 ?v5 ?v2)
        (not (pred_12 ?v5)) (not (pred_4 ?v13 ?v2))))

(:action op_4
:parameters (?v2 ?v12)
:precondition (and (pred_1 ?v2) (pred_9 ?v12) 
                  (pred_10 ?v2) (pred_12 ?v12))
:effect (and (pred_2 ) (pred_4 ?v12 ?v2) (not (pred_12 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_21 obj_01 obj_02 obj_11 obj_05 obj_03 obj_07 obj_16 obj_20 obj_12 obj_17 obj_15 obj_19 obj_18 obj_09
    obj_06 obj_14
    obj_04 obj_13 obj_08
    )

    (:init
       (pred_2)

       (pred_1 obj_10)
       (pred_1 obj_21)
       (pred_1 obj_01)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_1 obj_05)
       (pred_1 obj_03)
       (pred_1 obj_07)
       (pred_1 obj_16)
       (pred_1 obj_20)
       (pred_1 obj_12)
       (pred_1 obj_17)
       (pred_1 obj_15)
       (pred_1 obj_19)
       (pred_1 obj_18)
       (pred_1 obj_09)
       (pred_11 obj_06)
       (pred_11 obj_14)
       (pred_9 obj_04)
       (pred_9 obj_13)
       (pred_9 obj_08)

       (pred_7 obj_10 obj_11)
       (pred_7 obj_10 obj_21)
       (pred_7 obj_21 obj_05)
       (pred_7 obj_21 obj_01)
       (pred_7 obj_21 obj_10)
       (pred_7 obj_01 obj_03)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_01 obj_21)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_02 obj_01)
       (pred_7 obj_11 obj_16)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_05 obj_20)
       (pred_7 obj_05 obj_03)
       (pred_7 obj_05 obj_21)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_03 obj_12)
       (pred_7 obj_03 obj_07)
       (pred_7 obj_03 obj_01)
       (pred_7 obj_03 obj_05)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_07 obj_03)
       (pred_7 obj_16 obj_15)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_16 obj_11)
       (pred_7 obj_20 obj_19)
       (pred_7 obj_20 obj_12)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_12 obj_18)
       (pred_7 obj_12 obj_17)
       (pred_7 obj_12 obj_03)
       (pred_7 obj_12 obj_20)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_17 obj_12)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_15 obj_16)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_19 obj_20)
       (pred_7 obj_19 obj_15)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_18 obj_12)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_09 obj_18)
       (pred_6 obj_07)
       (pred_6 obj_03)
       (pred_6 obj_12)
       (pred_8  obj_07 obj_06)
       (pred_8  obj_03 obj_14)
       (pred_8  obj_12 obj_14)
       (pred_5 obj_10)
       (pred_5 obj_21)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_05)
       (pred_5 obj_16)
       (pred_5 obj_20)
       (pred_5 obj_17)
       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_5 obj_18)
       (pred_5 obj_09)

       (pred_3  obj_04 obj_06)
       (pred_3  obj_13 obj_14)
       (pred_3  obj_08 obj_14)
       (pred_4 obj_04 obj_09)
       (pred_4 obj_13 obj_10)
       (pred_4 obj_08 obj_17)
       (pred_10 obj_15)
    )

    (:goal (and
       (pred_4 obj_13 obj_02)
    ))
(:constraints
  (always (not (pred_10 obj_16)))
)
)

; plan
1. (op_1 obj_15 obj_19)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_19)
   goals met: 0 of 1
2. (op_1 obj_19 obj_20)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_20)
   goals met: 0 of 1
3. (op_1 obj_20 obj_05)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_21)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_21)
   goals met: 0 of 1
5. (op_1 obj_21 obj_10)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_10)
   goals met: 0 of 1
6. (op_3 obj_10 obj_13)
   deleted: (pred_4 obj_13 obj_10) (pred_2)
   added: (pred_12 obj_13)
   goals met: 0 of 1
7. (op_1 obj_10 obj_21)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_21)
   goals met: 0 of 1
8. (op_1 obj_21 obj_01)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_01)
   goals met: 0 of 1
9. (op_1 obj_01 obj_02)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_02)
   goals met: 0 of 1
10. (op_4 obj_02 obj_13)
   deleted: (pred_12 obj_13)
   added: (pred_2) (pred_4 obj_13 obj_02)
   goals met: 1 of 1
